BlokasLabs/Blokas-Boards/avr/boards.txt
# See:
# * https://code.google.com/archive/p/arduino/wikis/Platforms.wiki
# * https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification
# * https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6

menu.cpu=Processor

midimon.name=Midimon

midimon.vid.0=0x2341
midimon.pid.0=0x0043
midimon.vid.1=0x2341
midimon.pid.1=0x0001
midimon.vid.2=0x2A03
midimon.pid.2=0x0043
midimon.vid.3=0x2341
midimon.pid.3=0x0243

midimon.upload.tool=avrdude
midimon.upload.protocol=usbasp
midimon.upload.maximum_size=28672
midimon.upload.maximum_data_size=2048
midimon.upload.speed=115200

midimon.bootloader.tool=avrdude
midimon.bootloader.low_fuses=0xCE
midimon.bootloader.high_fuses=0xD8
midimon.bootloader.extended_fuses=0xFD
midimon.bootloader.unlock_bits=0xFF
midimon.bootloader.lock_bits=0xFF
midimon.bootloader.file=Midimon-Bootloader/Midimon-Bootloader.hex

midimon.build.mcu=atmega328p
midimon.build.f_cpu=20000000L
midimon.build.board=AVR_UNO
midimon.build.core=arduino:arduino
midimon.build.variant=midimon
# PD3 and PD2 used for USB D- and D+, PD4 is used for USB Pull-up.
midimon.build.extra_flags=-DUSB_CFG_IOPORTNAME=D -DUSB_CFG_DMINUS_BIT=3 -DUSB_CFG_DPLUS_BIT=2 -DUSB_CFG_PULLUP_IOPORTNAME=D -DUSB_CFG_PULLUP_BIT=4
